設置={
    內容:{
        文字速度:25,
        對話框背景透明度:0.8,
        總體音量:1,
        自動收起控制面板:false
    },
    初始化(){
        $('#文字速度').attr('value',設置.內容.文字速度);
        $('#對話框背景透明度').attr('value',設置.內容.對話框背景透明度);
        $('#總體音量').attr('value',設置.內容.總體音量);
        $('#自動收起控制面板').attr("checked", 設置.內容.自動收起控制面板); 
        設置.同調適用()
    },
    應用用戶設置(s){
        設置.內容=JSON.parse(s); 
        設置.初始化();
    },
    同調(element){
        var e = $(element)
        if(e.attr('type')=='checkbox')
            設置.內容[e.attr('id')]=e.is(':checked')
        else
            設置.內容[e.attr('id')]=e.val()
        設置.同調適用(); 
    },
    同調適用(){
        $('#名字框背景').css('opacity',設置.內容.對話框背景透明度);
        $('#話語框背景').css('opacity',設置.內容.對話框背景透明度);
        $('#對話框背景').css('opacity',設置.內容.對話框背景透明度);
        if(設置.內容.自動收起控制面板)
            $('#工具欄').attr('class', '自動收起');
        else
            $('#工具欄').attr('class', '');
        山彥.設置(JSON.stringify(設置.內容))
    }
};
$(function(){
    設置.初始化(); 
})